combustion/reactingFoam/BFR/0/U
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX(R) Core: Open-source CFD for Enterprise            |
|   o   O   o      | Version: 3.3.0                                           |
|    o     o       | ENGYS Ltd. <http://engys.com/>                           |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform ( 0 0 0 );

boundaryField
{
    wedgeFace1
    {
        type            wedge;
    }
    inletPrimary
    {
        type            fixedValue;
        value           uniform ( 2.053477 0 0 );
    }
    inletSecondary
    {
        type            fixedValue;
        value           uniform ( 4.827447 0 0 );
    }
    inletAmbient
    {
        type            fixedValue;
        value nonuniform
        (
            (1.868039012 0.7867641449 7.147181034)
            (4.469147682 2.027052641 10.29091644)
            (6.524629116 3.090357304 11.21446896)
            (7.948215008 3.759859800 11.49510479)
            (8.842724800 4.149442673 11.51684952)
            (9.397566795 4.372411728 11.41704082)
            (9.719843864 4.476028442 11.24520302)
            (9.866350174 4.495499134 11.02808857)
            (9.881971359 4.448816299 10.77063465)
            (9.794603348 4.343037128 10.49393559)
            (9.615644455 4.192168236 10.20353889)
            (9.382325172 4.001732349 9.919239998)
            (9.104012489 3.777939796 9.664211273)
            (8.802019119 3.529788017 9.446068764)
            (8.504680634 3.262526274 9.270412445)
            (8.216681480 2.985629082 9.129273415)
            (7.937578201 2.712002039 9.017991066)
            (7.614884377 2.468930721 8.916778564)
            (6.983522415 2.280838966 8.717851639)
            (5.038372517 1.318976521 5.948118210)
        );
    }
    wallInletNozzle
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    wallInlet
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    wallOuter
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
    }
    wedgeFace2
    {
        type            wedge;
    }
}


// ************************************************************************* //
