combustion/reactingFoam/BFR/0/O
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "wedgeFace.*"
    {
        type            wedge;
    }
    "wall.*"
    {
        type            fixedValue;
        value           uniform 0;
    }
    inletPrimary
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    inletSecondary
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    inletAmbient
    {
        type            fixedValue;
        value           uniform 0.234;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
}


// ************************************************************************* //
