combustion/reactingFoam/BFR/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }
    p
    {
        solver          GAMG;
        tolerance       1e-07;
        relTol          0.01;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 1;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }
    pFinal
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 1;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }
    "(U|h|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.1;
        minIter         1;
    }
    "(U|h|k|epsilon)Final"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
        minIter         1;
    }
    Yi
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
        minIter         1;
    }
    G
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.1;
        minIter         1;
    }

    GFinal
    {
        $G;
        relTol          0;
    }
}

cache
{
    grad(U) ;
}
PIMPLE
{
    turbOnFinalIterOnly false;
    ddtPhiCorr true;
    momentumPredictor yes;
    nOuterCorrectors 2;
    nCorrectors 2;
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;
    pMin 1.0E-10;
    pMax 1.0E10;
    consistent  true;
    residualControl
    {
        U
        {
            relTol 0.0;
            tolerance 0.001;
        }
        p
        {
            relTol 0.0;
            tolerance 0.001;
        }
        k
        {
            relTol 0.0;
            tolerance 0.001;
        }
        epsilon
        {
            relTol 0.0;
            tolerance 0.001;
        }
    }
    outerCorrectorResidualControl
    {
        "(p)"
        {
            relTol          0;
            tolerance       0.000;
        }
        "(U)"
        {
            relTol          0;
            tolerance       0.000;
        }
        "(s|k|omega)"
        {
            relTol          0;
            tolerance       0.000;
        }
    }
}


// ************************************************************************* //
