combustion/reactingFoam/BFR/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

#runApplication ideasUnvToFoam BFR_Mesh.unv
#runApplication transformPoints -scale "(0.001 0.001 0.001)"
runApplication decomposePar
runParallel $(getApplication)
runApplication reconstructPar

#------------------------------------------------------------------------------
